###############################
 BaseGeometry_integer_validaor
###############################

Usage:
`` instance.interger_validator(name, value) ``


import module

>>> BaseGeometry = __import__('7-base_geometry').BaseGeometry
>>> bg = BaseGeometry()


TestCase#0

>>> hasattr(bg, 'integer_validator')
True


TestCase#1

Basic Usage

>>> bg.integer_validator("my_int", 12)


TestCase#2

>>> bg.integer_validator("name", "John")
Traceback (most recent call last):
	...
TypeError: name must be an integer


TestCase#3

>>> bg.integer_validator("age", 0)
Traceback (most recent call last):
 ...
ValueError: age must be greater than 0

TestCase#4

>>> bg.integer_validator("distance", -4)
Traceback (most recent call last):
	...
ValueError: distance must be greater than 0


TestCase#4

>>> bg.integer_validator("John", None)
Traceback (most recent call last):
	...
TypeError: John must be an integer


TestCase#5

